Repository: cahyo40/2Gas
Catalog: lib/l10n/app_*.arb
Languages: id

# nav_home
source: Home
id: Beranda

# nav_task
source: Tasks
id: Tugas

# nav_search
source: Search
id: Cari

# nav_notif
source: Notifications
id: Notifikasi

# nav_settings
source: Settings
id: Pengaturan

# onboarding_page1_title
source: All your tasks, in one place.
id: Semua tugasmu, dalam satu tempat.

# onboarding_page1_subtitle
source: Manage to-do lists, projects, and ideas without the fuss. Focus on what matters.
id: Kelola to-do list, proyek, dan ide tanpa ribet. Fokus pada yang penting.

# onboarding_page1_button
source: Next
id: Lanjut

# onboarding_page2_title
source: Collaborate, no drama.
id: Kerja bareng, tanpa drama.

# onboarding_page2_subtitle
source: Create, share, and track tasks with your team — transparent and efficient.
id: Buat, bagi, dan pantau tugas bersama tim — semua transparan dan efisien.

# onboarding_page2_button
source: Next
id: Lanjut

# onboarding_page3_title
source: Productive without stress.
id: Produktif tanpa stres.

# onboarding_page3_subtitle
source: Track progress, celebrate achievements, and enjoy organized results.
id: Pantau progres, rayakan pencapaian, dan nikmati hasil kerja yang tertata.

# onboarding_page3_button
source: Start Now
id: Mulai Sekarang

# login_title
source: Sign in to 2Gas
id: Masuk ke 2Gas

# login_subtitle
source: Manage your tasks more easily and efficiently.
id: Kelola tugasmu dengan lebih mudah dan terarah.

# login_button_google
source: Continue with Google
id: Lanjut dengan Google

source: Good morning
id: Selamat pagi

source: Good afternoon
id: Selamat siang

source: Good evening
id: Selamat sore

source: Good night
id: Selamat malam

# field_title
source: Title
id: Judul

# field_title_hint
source: Enter a title
id: Masukkan judul

# field_description
source: Description
id: Deskripsi

# field_description_hint
source: Enter a description
id: Masukkan deskripsi

# field_address
source: Address
id: Alamat

# field_address_hint
source: Enter an address
id: Masukkan alamat

# field_email_hint
source: Enter your email
id: Masukkan email Anda

# field_category
source: Category
id: Kategori

# field_category_msg_required
source: Category is required.
id: Kategori wajib dipilih.

# field_categoory_delete_title
source: Delete Category
id: Hapus Kategori

# field_categoory_delete_message
source: Are you sure you want to delete this category?
id: Yakin ingin menghapus kategori ini?

source: Yes
id: Ya

source: No
id: Tidak

source: Cancel
id: Batal

source: Close
id: Tutup

# field_priority
source: Priority
id: Prioritas

# field_priority_hint
source: Select priority level
id: Pilih tingkat prioritas

# field_assigns
source: Assignees
id: Penerima Tugas

source: Select members
id: Pilih anggota

# nav_overview
source: Overview
id: Ikhtisar

# nav_project
source: Projects
id: Proyek

# nav_schedule
source: Schedule
id: Jadwal

# nav_activity
source: Activity
id: Aktivitas

source: All Members
id: Semua Anggota

source: Active Member
id: Anggota Aktif

source: Pending Member
id: Anggota Tertunda

# dialog_acc_member_title
source: Accept Member
id: Terima Anggota

# dialog_acc_member_content
source: Do you want to accept this member?
id: Terima anggota ini?

source: Accept
id: Terima

source: Decline
id: Tolak

# activity_org
source: Organization Activity
id: Aktivitas Organisasi

source: Member
id: Anggota

# today_schedule
source: Today's Schedule
id: Jadwal Hari Ini

source: Project Summary
id: Ringkasan Proyek

source: Active
id: Aktif

source: Completed
id: Selesai

source: Overdue
id: Terlambat

source: Task Summary
id: Ringkasan Tugas

source: Latest Activity
id: Aktivitas Terbaru

# msg_success_create_project
source: Project created successfully
id: Proyek berhasil dibuat

# search_project
source: Search projects
id: Cari proyek

source: Back to Home
id: Kembali ke Beranda

# msg_success_create_task
source: Task created successfully
id: Tugas berhasil dibuat

# setting_project
source: Project Settings
id: Pengaturan Proyek

# change_prioriy
source: Change Priority
id: Ubah Prioritas

source: Select Priority
id: Pilih Prioritas

source: Change Deadline
id: Ubat Tenggat Waktu

source: Delete Project
id: Hapus Proyek

# dialog_list_assign_project_title
source: Assign Project
id: Tugaskan Proyek

# dialog_list_assign_project_context
source: Select members to assign this project to
id: Pilih anggota untuk ditugaskan pada proyek ini

source: Assign
id: Tugaskan

# org_member_list
source: Organization Members
id: Daftar Anggota Organisasi

source: Creator
id: Pembuat

source: Priority
id: Prioritas

source: Deadline
id: Tenggat waktu

source: Categories
id: Kategori

source: Project Info
id: Info Proyek

source: Created by
id: Dibuat oleh

source: Created at
id: Dibuat pada

source: Description
id: Deskripsi

source: Task
id: Tugas

source: No description
id: Tidak ada deskripsi

source: See All
id: Lihat Semua

# msg_task_empty
source: No tasks yet
id: Belum ada tugas

# msg_cannot_change_data
source: You cannot change this data
id: Anda tidak bisa mengubah data

source: Create Project
id: Buat Proyek

source: Submit
id: Kirim

source: Select Category
id: Pilih Kategori

source: Category has been added
id: Kategori telah ditambahkan

source: Pending Approval
id: Menunggu Persetujuan

# overdue_by
source: Overdue by {day} days
id: Terlambat {day} hari

# overdue_in
source: Due in {day} days
id: Jatuh tempo dalam {day} hari

source: Please wait
id: Mohon tunggu

# my_org
source: My Organization
id: Organisasi Saya

# create_org
source: Create Organization
id: Buat Organisasi

# join_org
source: Join Organization
id: Gabung Organisasi

# add_org
source: Add Organization
id: Tambah Organisasi

source: Joined
id: Bergabung

source: Join
id: Gabung

# wait_for_approval
source: Please wait for approval
id: Tunggu persetujuan dahulu

# color_org
source: Organization Color
id: Warna Organisasi

source: Change Color
id: Ubah Warna

# org
source: Organization
id: Organisasi

source: Create Task
id: Buat Tugas

# notif_org_access_request_approved
source: You have been approved to join the {orgName} organization.
id: Anda telah disetujui bergabung dengan {orgName}.

# notif_org_user_joined
source: {userName} wants to join the organization {orgName}.
id: {userName} ingin bergabung dengan organisasi {orgName}.

# notif_org_role_changed_to_admin
source: You have been made an admin in the {orgName} organization.
id: Anda telah dijadikan admin di organisasi {orgName}.

# notif_org_user_removed
source: You have been removed from the {orgName} organization.
id: Anda telah dikeluarkan dari organisasi {orgName}.

# notif_project_user_added
source: You have been added to the {projectName} project.
id: Anda telah ditambahkan ke proyek {projectName}.

# notif_project_user_removed
source: You have been removed from the {projectName} project.
id: Anda telah dikeluarkan dari proyek {projectName}.

# notif_project_data_updated
source: The {projectName} project data has been updated.
id: Data proyek {projectName} telah diperbarui.

# notif_task_assigned
source: You have been assigned a new task: {taskName} in the {projectName} project.
id: Anda mendapat tugas baru: {taskName} di proyek {projectName}.

# notif_task_user_unassigned
source: You have been unassigned from the task {taskName}.
id: Anda dikeluarkan dari tugas {taskName}.

# notif_task_updated
source: The task {taskName} has been updated.
id: Tugas {taskName} telah diperbarui.

# task_done
source: Completed
id: Selesai

# task_in_progress
source: In Progress
id: Dalam Proses

# task_not_started
source: Not Started
id: Belum Dimulai

source: All
id: Semua

source: Log Out
id: Keluar

# msg_logout_title
source: Confirm Logout
id: Konfirmasi Keluar

# msg_logout_content
source: Are you sure you want to log out?
id: Yakin ingin keluar?

source: Owner
id: Pemilik

source: Theme
id: Tema

source: Dark Mode
id: Mode Gelap

source: Light Mode
id: Mode Terang

source: Language
id: Bahasa

# overdue_by_day
source: Overdue by {day} day
id: Terlambat {day} hari

source: Due tomorrow
id: Besok deadline

# due_in_days
source: {day} days left
id: {day} hari lagi

# notif_org_access_request_approved_title
source: Organization Access Approved
id: Akses Organisasi Disetujui

# notif_org_user_request_joined_title
source: New Join Request
id: Permintaan Bergabung Baru

# notif_org_role_changed_to_admin_title
source: Role Upgraded
id: Jabatan Diperbarui

# notif_org_user_removed_title
source: Removed from Organization
id: Dikeluarkan dari Organisasi

# notif_project_user_added_title
source: Added to Project
id: Ditambahkan ke Proyek

# notif_project_user_removed_title
source: Removed from Project
id: Dihapus dari Proyek

# notif_project_data_updated_title
source: Project Updated
id: Proyek Diperbarui

# notif_task_assigned_title
source: Task Assigned
id: Tugas Ditugaskan

# notif_task_user_unassigned_title
source: Task Unassigned
id: Tugas Dibatalkan Penugasan

# notif_task_updated_title
source: Task Updated
id: Tugas Diperbarui

# notif_task_deleted_title
source: Task Deleted
id: Tugas Dihapus

# notif_task_deleted_description
source: Task "{taskName}" has been deleted.
id: Tugas "{taskName}" telah dihapus.

# msg_task_delete_title
source: Delete Task
id: Hapus Tugas

# msg_task_delete_content
source: Are you sure you want to delete this task?
id: Yakin ingin menghapus tugas ini?

# msg_task_deleted_success
source: Task deleted successfully
id: Tugas berhasil dihapus

# activity_task_created_title
source: New Task
id: Task Baru

# activity_task_updated_title
source: Task Updated
id: Task Diperbarui

# activity_task_deleted_title
source: Task Deleted
id: Task Dihapus

# activity_task_moved_title
source: Task Status Changed
id: Task Berubah Status

# activity_project_created_title
source: New Project
id: Project Baru

# activity_project_updated_title
source: Project Updated
id: Project Diperbarui

# activity_project_deleted_title
source: Project Deleted
id: Project Dihapus

# activity_project_completed_title
source: Project Completed
id: Project Selesai

# activity_member_join_title
source: New Member
id: Anggota Baru

# activity_member_remove_title
source: Member Removed
id: Anggota Dikeluarkan

# activity_member_left_title
source: Member Left
id: Anggota Keluar

# activity_member_change_role
source: Member Role Changed
id: Anggota Berubah Jabatan

# activity_project_comment_title
source: New Comment
id: Komentar Baru

# activity_schedule_created_title
source: New Schedule
id: Jadwal Baru

# activity_schedule_edited_title
source: Schedule Changed
id: Jadwal Berubah

# activity_schedule_deleted_title
source: Schedule Cancelled
id: Jadwal Dibatalkan

# activity_org_created_title
source: New Organization
id: Organisasi Baru

# activity_org_updated_title
source: Organization Updated
id: Organisasi Diperbarui

# activity_task_created_desc
source: {user} created task {taskName} in project {projectName}
id: {user} membuat task {taskName} pada project {projectName}

# activity_task_updated_desc
source: {user} updated task {taskName} -> "{info}"
id: {user} mengubah data task {taskName} -> "{info}"

# activity_task_deleted_desc
source: {user} deleted task {taskName} from project {projectName}
id: {user} menghapus task {taskName} dari project {projectName}

# activity_task_move_desc
source: {user} updated task {taskName} status -> {info}
id: {user} memperbarui status task {taskName} -> {info}

# activity_project_created_desc
source: {user} created project {projectName}
id: {user} membuat project {projectName}

# activity_project_updated_desc
source: {user} updated project data -> {info}
id: {user} mengubah data project -> {info}

# activity_project_deleted_desc
source: {user} deleted project {projectName} on {info}
id: {user} menghapus project {projectName} pada {info}

# activity_project_completed_desc
source: Project completed on {info}
id: project sudah selesai pada {info}

# activity_member_join_desc
source: {user} joined {orgName}
id: {user} bergabung dengan {orgName}

# activity_member_remove_desc
source: {user} removed {info}
id: {user} mengeluarkan {info}

# activity_member_left_desc
source: {user} left the organization
id: {user} meninggalkan organisasi

# activity_member_change_role_desc
source: {user} role changed to {info}
id: {user} berubah jabatan menjadi {info}

# activity_project_comment_desc
source: {user} commented on project {project} -> "{info}"
id: {user} memberi komentar pada project {project} -> "{info}"

# activity_schedule_created_desc
source: {user} created schedule {scheduleName}
id: {user} membuat jadwal {scheduleName}

# activity_schedule_edited_desc
source: {user} edited schedule {scheduleName} -> {info}
id: {user} mengubah jadwal {scheduleName} -> {info}

# activity_schedule_deleted_desc
source: {user} cancelled schedule {scheduleName}
id: {user} membatalkan jadwal {scheduleName}

# activity_org_created_desc
source: {user} created organization {orgName}
id: {user} membuat organisasi {orgName}

# activity_org_updated_desc
source: {user} updated organization data -> {info}
id: {user} mengubah data organisasi -> {info}

source: Make Admin
id: Jadikan Admin

source: Demote to Member
id: Kembalikan Jadi Member

source: Remove Member
id: Keluarkan Member

# dialog_remove_member_title
source: Remove Member
id: Keluarkan Member

# dialog_remove_member_content
source: Are you sure you want to remove this member?
id: Yakin ingin mengeluarkan member ini?

source: Delete Organization
id: Hapus Organisasi

# dialog_delete_org_title
source: Delete Organization
id: Hapus Organisasi

# dialog_delete_org_content
source: Are you sure you want to delete this organization? All projects, tasks, and data will be permanently lost.
id: Yakin ingin menghapus organisasi ini? Seluruh proyek, tugas, dan data akan hilang selamanya.

# dialog_project_title
source: Delete Project
id: Hapus Proyek

# dialog_project_content
source: Are you sure you want to delete this project? All tasks and related data will be permanently lost.
id: Yakin ingin menghapus proyek ini? Seluruh tugas dan data terkait akan hilang selamanya.

# no_today_schedule
source: No schedule for today
id: Tidak ada jadwal hari ini

# no_project_title
source: No projects yet
id: Belum ada proyek

# no_project_desc
source: Create your first project to start organizing tasks.
id: Buat proyek pertama Anda untuk mulai menata tugas.

# no_task_title
source: No tasks here
id: Belum ada tugas

# no_task_desc
source: Add a new task to get things rolling.
id: Tambahkan tugas baru untuk memulai.

# no_activity_title
source: No recent activity
id: Tidak ada aktivitas terbaru

# no_activity_desc
source: Activity will appear here when members start working.
id: Aktivitas akan muncul saat anggota mulai bekerja.

# no_member_title
source: No members yet
id: Belum ada anggota

# no_member_desc
source: Invite people to collaborate in this organization.
id: Undang orang untuk berkolaborasi di organisasi ini.

# no_notif_title
source: No notifications
id: Tidak ada notifikasi

# no_notif_desc
source: You're all caught up—notifications will appear here.
id: Anda sudah up to date—notifikasi akan muncul di sini.

# no_org_title
source: No organizations
id: Belum ada organisasi

# no_org_desc
source: Create or join an organization to start collaborating.
id: Buat atau gabung organisasi untuk mulai berkolaborasi.

source: Refresh
id: Segarkan
